# # 081 별 표현식
# # 기본적으로 데이터 언패킹은 좌변의 변수와 우변 데이터 개수가 같아야 합니다.
# # 하지만 star expression을 사용하면 변수의 개수가 달라도 데이터 언패킹을 할 수 있습니다.
# # 튜플에 저장된 데이터 중에서 앞에 있는 두 개의 데이터만 필요할 경우 나머지 데이터의 언패킹 코드를 작성할 필요가 없습니다.
# # >> a, b, *c = (0, 1, 2, 3, 4, 5)
# # >> a
# # 0
# # >> b
# # 1
# # >> c
# # [2, 3, 4, 5]
# # 다음과 같이 10개의 값이 저장된 scores 리스트가 있을 때,
# # start expression을 사용하여 좌측 8개의 값을 valid_score 변수에 바인딩하여라.
# scores = [8.8, 8.9, 8.7, 9.2, 9.3, 9.7, 9.9, 9.5, 7.8, 9.4]
# *valid_score, a, b = scores
# print(valid_score)
#
# # 082
# # 다음과 같이 10개의 값이 저장된 scores 리스트가 있을 때,
# # start expression을 사용하여 우측 8개의 값을 valid_score 변수에 바인딩하여라.
# scores = [8.8, 8.9, 8.7, 9.2, 9.3, 9.7, 9.9, 9.5, 7.8, 9.4]
# a, b, *valid_scores = scores
# print(valid_scores)
#
# # 083
# # 다음과 같이 10개의 값이 저장된 scores 리스트가 있을 때,
# # start expression을 사용하여 가운데 있는 8개의 값을 valid_score 변수에 바인딩하여라.
# scores = [8.8, 8.9, 8.7, 9.2, 9.3, 9.7, 9.9, 9.5, 7.8, 9.4]
# _, *valid_score, _ = scores
# print(valid_score)
#
# # 084 비어있는 딕셔너리
# # temp 이름의 비어있는 딕셔너리를 만들라.
# temp = {}
#
# # 085
# # 다음 아이스크림 이름과 희망 가격을 딕셔너리로 구성하라.
# # 이름	희망 가격
# # 메로나	1000
# # 폴라포	1200
# # 빵빠레	1800
# icecream = { "메로나" : 1000, "폴라포" : 1200, "빵빠레" : 1800}
# print(icecream)
#
# # 086
# # 085 번의 딕셔너리에 아래 아이스크림 가격정보를 추가하라.
# # 이름	희망 가격
# # 죠스바	1200
# # 월드콘	1500
# icecream = { "메로나" : 1000, "폴라포" : 1200, "빵빠레" : 1800}
# icecream["죠스바"] = 1200
# icecream["월드콘"] = 1500
# print(icecream)
#
# # 087
# # 다음 딕셔너리를 사용하여 메로나 가격을 출력하라.
# ice = {'메로나': 1000,
#        '폴로포': 1200,
#        '빵빠레': 1800,
#        '죠스바': 1200,
#        '월드콘': 1500}
# # 실행 예: 메로나 가격: 1000
# print("메로나 가격:", ice["메로나"])
#
# # 088
# # 다음 딕셔너리에서 메로나의 가격을 1300으로 수정하라.
# ice = {'메로나': 1000,
#        '폴로포': 1200,
#        '빵빠레': 1800,
#        '죠스바': 1200,
#        '월드콘': 1500}
# ice["메로나"] = 1300
# print(ice)
#
# # 089
# # 다음 딕셔너리에서 메로나를 삭제하라.
# ice = {'메로나': 1000,
#        '폴로포': 1200,
#        '빵빠레': 1800,
#        '죠스바': 1200,
#        '월드콘': 1500}
# # ice.__delitem__("메로나")
# del ice["메로나"]
# print(ice)
#
# # 090
# # 다음 코드에서 에러가 발생한 원인을 설명하라.
# # >> icecream = {'폴라포': 1200, '빵빠레': 1800, '월드콘': 1500, '메로나': 1000}
# # >> icecream['누가바']
# # Traceback (most recent call last):
# #   File "<pyshell#69>", line 1, in <module>
# #     icecream['누가바']
# # KeyError: '누가바'
# # key값 중 "누가바"가 없기 때문에
#
# ============================================================================================
#
# # 091 딕셔너리 생성
# # 아래의 표에서, 아이스크림 이름을 키값으로, (가격, 재고) 리스트를 딕셔너리의 값으로 저장하라.
# # 딕셔너리의 이름은 inventory로 한다.
# # 이름	  가격	 재고
# # 메로나	  300     20
# # 비비빅	  400     3
# # 죠스바	  250	 100
# inventory = { "메로나" : [300, 20],
#               "비비빅" : [400, 3],
#               "죠스바" : [250, 100] }
# print(inventory, type(inventory))
#
# # 092 딕셔너리 인덱싱
# # inventory 딕셔너리에서 메로나의 가격을 화면에 출력하라.
# inventory = {"메로나": [300, 20],
#               "비비빅": [400, 3],
#               "죠스바": [250, 100]}
# # 실행 예시: 300 원
# print(inventory["메로나"][0], "원")
#
# # 093 딕셔너리 인덱싱
# # inventory 딕셔너리에서 메로나의 재고를 화면에 출력하라.
# inventory = {"메로나": [300, 20],
#               "비비빅": [400, 3],
#               "죠스바": [250, 100]}
# # 실행 예시: 20 개
# print(inventory[input("재고를 확인하고 싶은 재고명을 입력하세요.\n")][1], "개")
#
# # 094 딕셔너리 추가
# # inventory 딕셔너리에 아래 데이터를 추가하라.
# inventory = {"메로나": [300, 20],
#               "비비빅": [400, 3],
#               "죠스바": [250, 100]}
# # 이름	  가격	재고
# # 월드콘	  500	7
# # 실행 예시:
# # >> print(inventory)
# # {'메로나': [300, 20], '비비빅': [400, 3], '죠스바': [250, 100], '월드콘': [500, 7]}
# inventory["월드콘"] = [500, 7]
# print(inventory)
#
# # 095 딕셔너리 keys() 메서드
# # 다음의 딕셔너리로부터 key 값으로만 구성된 리스트를 생성하라.
# icecream = {'탱크보이': 1200, '폴라포': 1200, '빵빠레': 1800, '월드콘': 1500, '메로나': 1000}
# print(list(icecream.keys()))
#
# # 096 딕셔너리 values() 메서드
# # 다음의 딕셔너리에서 values 값으로만 구성된 리스트를 생성하라.
# icecream = {'탱크보이': 1200, '폴라포': 1200, '빵빠레': 1800, '월드콘': 1500, '메로나': 1000}
# list_icecream = list(icecream.values())
# print(list_icecream)
#
# # 097 딕셔너리 values() 메서드
# # icecream 딕셔너리에서 아이스크림 판매 금액의 총합을 출력하라.
# icecream = {'탱크보이': 1200, '폴라포': 1200, '빵빠레': 1800, '월드콘': 1500, '메로나': 1000}
# # 출력 예시: 6700
# icecream_list = list(icecream.values())
# # print(type(icecream_list), icecream_list)
# print(sum(icecream_list))
#
# # 098 딕셔너리 update 메서드
# # 아래의 new_product 딕셔너리를 다음 icecream 딕셔너리에 추가하라.
# icecream = {'탱크보이': 1200, '폴라포': 1200, '빵빠레': 1800, '월드콘': 1500, '메로나': 1000}
# new_product = {'팥빙수':2700, '아맛나':1000}
# # 실행 예시:
# # >> print(icecream)
# # {'탱크보이': 1200,  '폴라포': 1200,  '빵빠레': 1800,  '월드콘': 1500,  '메로나': 1000,  '팥빙수':2700, '아맛나':1000}
# icecream.update(new_product)
# print(icecream)
# ★ 딕셔너리끼리 합칠 때 : 딕셔너리_이름.update(합치고_싶은_딕셔너리_이름)
#
# # 099 zip과 dict
# # 아래 두 개의 튜플을 하나의 딕셔너리로 변환하라.
# # keys를 키로, vals를 값으로 result 이름의 딕셔너리로 저장한다.
# keys = ("apple", "pear", "peach")
# vals = (300, 250, 400)
# # 실행 예시:
# # >> print(result)
# # {'apple': 300, 'pear': 250, 'peach': 400}
# result = dict(zip(keys, vals))
# print(result)
# # ★ zip( A, B ) : A와 B를 튜플로 만들어줌
#
# # 100 zip과 dict
# # date와 close_price 두 개의 리스트를 close_table 이름의 딕셔너리로 생성하라.
# date = ['09/05', '09/06', '09/07', '09/08', '09/09']
# close_price = [10500, 10300, 10100, 10800, 11000]
# # 실행 예시:
# # >> print(close_table)
# # {'09/05': 10500, '09/06': 10300, '09/07': 10100, '09/08': 10800, '09/09': 11000}
# close_table = dict(zip(date, close_price))
# print(close_table)